piergatt/stm32ai-modelzoo-services-generalised_object_detection/application_code/semantic_segmentation/STM32N6/Application/NUCLEO-N657X0-Q/Src/main.c
static void IAC_Config(void)
{
/* Configure IAC to trap illegal access events */
  __HAL_RCC_IAC_CLK_ENABLE();
  __HAL_RCC_IAC_FORCE_RESET();
  __HAL_RCC_IAC_RELEASE_RESET();
}

void IAC_IRQHandler(void)
{
  while (1)
  {
  }
}

/**
* @brief Display Neural Network output classification results as well as other performances informations
*
* @param p_postprocess pointer to postprocessing output
* @param inference_ms inference time in ms
*/
static void Display_NetworkOutput(sseg_pp_out_t *p_postprocess, uint32_t inference_ms)
{
  uint8_t *mask = p_postprocess->pOutBuff;
  int ret;

  __disable_irq();
  ret = SCRL_SetAddress_NoReload(lcd_fg_buffer[lcd_fg_buffer_rd_idx], SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();

  /* Draw post processing result */
  int x_lcd, y_lcd;
  float x_ratio_lcd, y_ratio_lcd, x_ratio_nn, y_ratio_nn;
  int work=0, len_work=0;
  uint16_t *lcd_fg_buffer_u16 = line_buffer_u16[work];

  /* Display mask */
  y_lcd = 0;
  y_ratio_lcd = (y_lcd + 1.0f) / (float) lcd_bg_area.YSize;
  for (int y_nn = 0; y_nn < AI_SSEG_DEEPLABV3_PP_HEIGHT; y_nn++)
  {
    y_ratio_nn = (y_nn + 1.0f) / (float) AI_SSEG_DEEPLABV3_PP_HEIGHT;

    while (y_ratio_lcd <= y_ratio_nn)
    {
      x_lcd = 0;
      x_ratio_lcd = (x_lcd + 1.0f) / (float) lcd_bg_area.XSize;

      for (int x_nn = 0; x_nn < AI_SSEG_DEEPLABV3_PP_WIDTH; x_nn++)
      {
        x_ratio_nn = (x_nn + 1.0f) / (float) AI_SSEG_DEEPLABV3_PP_WIDTH;

        while (x_ratio_lcd <= x_ratio_nn)
        {
          for (int i = 0; i < NB_CLASSES-1; i++)
            if (mask[y_nn * AI_SSEG_DEEPLABV3_PP_WIDTH + x_nn] == i+1)
            {
              lcd_fg_buffer_u16[len_work] = colors_u16[i % NUMBER_COLORS];
              break;
            }

          len_work++;

          x_lcd++;
          x_ratio_lcd = (x_lcd + 1.0f) / (float) lcd_bg_area.XSize;
        }
      }

      /* Clean filled line buffer to allow DMA copy */
      SCB_CleanDCache_by_Addr(line_buffer_u16[work], LCD_FG_WIDTH * 2);
      /* Wait for DMA transfer to end */
      while (!transferCompleteDetected);

      /* End of mask line : update variables */
      push = work;
      work = 1 - work;
      len_work = 0;
      lcd_fg_buffer_u16 = line_buffer_u16[work];

      /* Start DMA copy */
      transferCompleteDetected = 0;
      transferNeedClear = 1;
      ret = HAL_DMA_Start_IT(&handle_HPDMA1_Channel12,
                             (uint32_t) line_buffer_u16[push],
                             (uint32_t) &lcd_fg_buffer[lcd_fg_buffer_rd_idx][(y_lcd * LCD_FG_WIDTH)*2],
                             LCD_FG_WIDTH * 2);
      assert(ret == HAL_OK);

      y_lcd++;
      y_ratio_lcd = (y_lcd + 1.0f) / (float) lcd_bg_area.YSize;
    }
  }

  UTIL_LCD_SetBackColor(0x40000000);
  UTIL_LCDEx_PrintfAt(0, LINE(18), CENTER_MODE, "Inference: %ums", inference_ms);
  UTIL_LCD_SetBackColor(0);

  Display_WelcomeScreen();

  __disable_irq();
  ret = SCRL_ReloadLayer(SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

static void Display_init(void)
{
  SCRL_LayerConfig layers_config[2] = {
    {
      .origin = {lcd_bg_area.X0, lcd_bg_area.Y0},
      .size = {lcd_bg_area.XSize, lcd_bg_area.YSize},
      .format = SCRL_RGB565,
      .address = lcd_bg_buffer,
    },
    {
      .origin = {lcd_fg_area.X0, lcd_fg_area.Y0},
      .size = {lcd_fg_area.XSize, lcd_fg_area.YSize},
      .format = SCRL_ARGB4444,
      .address = lcd_fg_buffer[lcd_fg_buffer_rd_idx],
    },
  };
  SCRL_ScreenConfig screen_config = {
    .size = {LCD_FG_WIDTH, LCD_FG_HEIGHT},
#ifdef SCR_LIB_USE_SPI
    .format = SCRL_RGB565,
#else
    .format = SCRL_YUV422, /* Use SCRL_RGB565 if host support this format to reduce cpu load */
#endif
    .address = screen_buffer,
    .fps = CAMERA_FPS,
  };
  int ret;

  /* Initialize the LCD to black */
#ifdef SCR_LIB_USE_SPI
  memset(screen_buffer, 0, sizeof(screen_buffer));
  SCB_CleanDCache_by_Addr(screen_buffer, sizeof(screen_buffer));
#else
  uint32_t *p_screen_buffer = (uint32_t *) screen_buffer;
  for (int i = 0; i < sizeof(screen_buffer)/4; i++)
  {
    p_screen_buffer[i] = 0x80108010;
  }
  SCB_CleanDCache_by_Addr(screen_buffer, sizeof(screen_buffer));
#endif

  ret = SCRL_Init((SCRL_LayerConfig *[2]){&layers_config[0], &layers_config[1]}, &screen_config);
  assert(ret == 0);

  UTIL_LCD_SetLayer(SCRL_LAYER_1);
  UTIL_LCD_Clear(UTIL_LCD_COLOR_TRANSPARENT);
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);

  for (int i = 0; i < NUMBER_COLORS; i++)
  {
    colors_u16[i] = 0x4000; /* Alpha */
    colors_u16[i] |= (colors[i] & 0x000000f0) << 4; /* B */
    colors_u16[i] |= (colors[i] & 0x0000f000) >> 8; /* G */
    colors_u16[i] |= (colors[i] & 0x00f00000) >> 20; /* R */
  }
}

/**
 * @brief Displays a Welcome screen
 */
static void Display_WelcomeScreen(void)
{
  static uint32_t t0 = 0;
  if (t0 == 0)
    t0 = HAL_GetTick();

  if (HAL_GetTick() - t0 < 4000)
  {
    /* Draw logo */
    UTIL_LCD_FillRGBRect((lcd_bg_area.XSize-200)/2, 54, (uint8_t *) stlogo, 200, 107);

    /* Display welcome message */
    UTIL_LCD_SetBackColor(0x40000000);
    UTIL_LCDEx_PrintfAt(0, LINE(15), CENTER_MODE, "Semantic segmentation");
    UTIL_LCDEx_PrintfAt(0, LINE(16), CENTER_MODE, WELCOME_MSG_1);
    UTIL_LCDEx_PrintfAt(0, LINE(17), CENTER_MODE, WELCOME_MSG_2[0]);
    UTIL_LCDEx_PrintfAt(0, LINE(18), CENTER_MODE, WELCOME_MSG_2[1]);
    UTIL_LCD_SetBackColor(0);
  }
}

/**
  * @brief  DCMIPP Clock Config for DCMIPP.
  * @param  hdcmipp  DCMIPP Handle
  *         Being __weak it can be overwritten by the application
  * @retval HAL_status
  */
HAL_StatusTypeDef MX_DCMIPP_ClockConfig(DCMIPP_HandleTypeDef *hdcmipp)
{
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};
  HAL_StatusTypeDef ret = HAL_OK;

  RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_DCMIPP;
  RCC_PeriphCLKInitStruct.DcmippClockSelection = RCC_DCMIPPCLKSOURCE_IC17;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockSelection = RCC_ICCLKSOURCE_PLL2;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockDivider = 3;
  ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
  if (ret)
  {
    return ret;
  }

  RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CSI;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockDivider = 40;
  ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
  if (ret)
  {
    return ret;
  }

  return ret;
}

static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};

